# ***********************************************************************************************
# Title   : あたらしいPythonで学ぶ統計学の教科書
# Chapter : 4 統計モデルの基本
# Theme   : 1 統計モデル
# Date    : 2022/05/03
# Page    : P234 - P240
# URL     : https://logics-of-blue.com/python-stats-book-support/
# ***********************************************************************************************


# ＜モデルの目的＞
# - 複雑な世界を単純化して現実世界の理解や予測に活用する


# ＜モデルの種類＞
# - 数理モデルとは現象を数式でモデル化したもの
# - 確率モデルとは数理モデルの中で確率的な表現を伴うモデル
# - 統計モデルとはデータに適合するようにパラメータ調整して構築された確率モデル（本書のモデル）
#   --- 統計モデルによる予測値(Y)は条件付確率分布として得られる


# ＜統計モデルのメリット＞
# - 統計モデルを使うことで確率分布のパラメータ変化のパターンを明らかにすることができる
# - 複数の要因を含めてモデル化することで要因間の影響を排除することができて本質が見えやすくなる
